function checks(newName){
    var regEn = /[`~!@#$%^&*()_+<>?:"{},.\/;'[\]]/im,
    regCn = /[·！#￥（——）：；“”‘、，|《。》？、【】[\]]/im;
if(regEn.test(newName) || regCn.test(newName)) {
    return false;
}else{
    return true;
}
}
//false说明里面包含特殊字符
//true说明里面不包含特殊字符
function Trim(str)
    {
         result = str.replace(/\s/g,"");
         return result;
     }
function dump(str){
  console.log(str);
}

/*

    /*"^\\d+$"　　//非负整数（正整数+0）      
    "^[0-9]*[1-9][0-9]*$"　　//正整数      
    "^((-\\d+)|(0+))$"　　//非正整数（负整数+0）      
    "^-[0-9]*[1-9][0-9]*$"　　//负整数      
    "^-?\\d+$"　　　　//整数      
    "^\\d+(\\.\\d+)?$"　　//非负浮点数（正浮点数+0）      
    "^(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*))$"　　//正浮点数      
    "^((-\\d+(\\.\\d+)?)|(0+(\\.0+)?))$"　　//非正浮点数（负浮点数   +   0）      
    "^(-(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*)))$"　　//负浮点数      
    "^(-?\\d+)(\\.\\d+)?$"　　//浮点数*/  

 
